Autodesk.Revit.DB.Structure.SurfaceElementExtension
Presets for given Analytical Extension.

Autodesk.Revit.DB.Structure.SurfaceElementExtension.Plane
Use a Plane for extension (e.g., Grid, Level).

Autodesk.Revit.DB.Structure.SurfaceElementExtension.BottomOrTop
Bottom or Top of physical element.